
	
	Функционал: Понимание языка Gherkin
	Как новичок-тестер я хочу изучить язык
	Чтобы хорошо выполнять свою работу и приносить пользу 
	
	Контекст:
	Дано у меня есть видеоуроки и нужное ПО для обучения
	
	Сценарий: Моя первая фича, сложение двух чисел
	Когда у меня есть первое слагаемое 2
	И когда у меня есть второе слагаемое 3
	Тогда я получу сумму 5
	
	Структура сценария: 
	Когда у меня есть первое слагаемое <Первое слагаемое>
	И когда у меня есть второе слагаемое <Второе слагаемое>
	Тогда я получу сумму <Сумма>
	
	Примеры:
	|Первое слагаемое|Второе слагаемое  |Сумма  |
	|2               |2					|5		|
	|20				 |30				|50		|
	|200			 |300				|555	|